# Project 1
**Maddy Bursell, Kim McKeever**

In [1]:
#Libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Part 1: Data Processing

In this project, we will be reading in files that use 2010 US census data. The goal will be to first read in the data and parse it into a format we can use. Then we will write some functions to pull in a later data set. {Probably do more things too, this is a brief introduction}

First, we read in the initial census data to examine:

In [2]:
import_data = pd.read_csv("https://www4.stat.ncsu.edu/~online/datasets/EDU01a.csv")
import_data.head()

,Area_name,STCOU,EDU010187F,EDU010187D,EDU010187N1,EDU010187N2,EDU010188F,EDU010188D,EDU010188N1,EDU010188N2,...,EDU010194N1,EDU010194N2,EDU010195F,EDU010195D,EDU010195N1,EDU010195N2,EDU010196F,EDU010196D,EDU010196N1,EDU010196N2
0,UNITED STATES,0,0,40024299,0,0,0,39967624,0,0,...,0,0,0,43993459,0,0,0,44715737,0,0
1,ALABAMA,1000,0,733735,0,0,0,728234,0,0,...,0,0,0,727989,0,0,0,736825,0,0
2,"Autauga, AL",1001,0,6829,0,0,0,6900,0,0,...,0,0,0,7568,0,0,0,7834,0,0
3,"Baldwin, AL",1003,0,16417,0,0,0,16465,0,0,...,0,0,0,19961,0,0,0,20699,0,0
4,"Barbour, AL",1005,0,5071,0,0,0,5098,0,0,...,0,0,0,5017,0,0,0,5053,0,0

We want to select only certain columns, but we first want to rename our column Area_name as area_name. We will do this using the .rename() method.

In [3]:
census_df = import_data.rename(columns = {"Area_name":"area_name"}, inplace = True)

We only want to maintain a few columns with specific parameters: we want 'Area_name', 'STCOU', and any column that ends with the letter 'D'. Since we want to select all columns ending in "D", we are locating those names first:

In [4]:
cols=list(import_data)
col_names=[]
for x in cols:
    if x.endswith("D"):
        col_names.append(x)
    else:
        continue

Creating a list of desired columns for our modified data frame by using specific coumn names from the import data and by unpacking the list of column names that end with "D" that was generated in the previous line.

In [5]:
col_list=['area_name', 'STCOU', *col_names]

Now, using the `.loc()` method and the desired columns found in 'col_list', we add those columns to our dataframe. A preview of this dataframe can be seen by calling `census_df.head()`

In [6]:
 census_df=import_data.loc[:,col_list]
 census_df.head()

,area_name,STCOU,EDU010187D,EDU010188D,EDU010189D,EDU010190D,EDU010191D,EDU010192D,EDU010193D,EDU010194D,EDU010195D,EDU010196D
0,UNITED STATES,0,40024299,39967624,40317775,40737600,41385442,42088151,42724710,43369917,43993459,44715737
1,ALABAMA,1000,733735,728234,730048,728252,725541,726150,728014,730509,727989,736825
2,"Autauga, AL",1001,6829,6900,6920,6847,7008,7137,7152,7381,7568,7834
3,"Baldwin, AL",1003,16417,16465,16799,17054,17479,17983,18735,19384,19961,20699
4,"Barbour, AL",1005,5071,5098,5068,5156,5173,5252,5135,5111,5017,5053

Now, we will convert our data into long format where each row has only one enrollment value for the column area_name. This will help to get rid of multiple observations in a given row.

In [7]:
census_df = census_df.melt(id_vars = ["area_name", "STCOU"], var_name = "info", value_name = "enrollment")
census_df.head()

       area_name  STCOU        info  enrollment
0  UNITED STATES      0  EDU010187D    40024299
1        ALABAMA   1000  EDU010187D      733735
2    Autauga, AL   1001  EDU010187D        6829
3    Baldwin, AL   1003  EDU010187D       16417
4    Barbour, AL   1005  EDU010187D        5071

Each variable in the info column holds important information. The last two characters before the "D" represent the year. We want to create a new column called "year" that stores the year. The first three characters represent the survey and the next four represent the type of value you have from the survey. We want to capture those first seven characters in another column called "measurement."

First, we will create new empty columns in our dataframe. Then, we will loop through the dataframe by the row, find the info column value, and parse out the measurment and the year. the value for each row will be added to the new columns of the dataframe.

In [8]:
census_df["year"] = np.nan
census_df["measurement"] = np.nan
for row in range(len(census_df)):
    thing = census_df.loc[row, "info"]
    #print(thing)
    measure = thing[0:7]
    #print(measure)
    yr = "19" + str(thing[7:9])
    #print(yr)
    census_df.loc[row,"year"] = int(yr)
    census_df.loc[row,"measurement"] = str(measure)

In [9]:
census_df.head()

       area_name  STCOU        info  enrollment    year measurement
0  UNITED STATES      0  EDU010187D    40024299  1987.0     EDU0101
1        ALABAMA   1000  EDU010187D      733735  1987.0     EDU0101
2    Autauga, AL   1001  EDU010187D        6829  1987.0     EDU0101
3    Baldwin, AL   1003  EDU010187D       16417  1987.0     EDU0101
4    Barbour, AL   1005  EDU010187D        5071  1987.0     EDU0101

We can see that the "area_name" column holds two different kinds of values: states and counties of states. We would like to create two separate dataframes that hold the state-level data and the county-level data. To do that, we will create an indexing vector using a lambda function. The lambda function is searching the string within each row, in the 'area_name' column, searching to match if the fourth character of from the end is a `','`. This information is passed into a new column on the data frame that expresses a boolean to identify whether or not the row represented is part of a county or not.

In [10]:
census_df["is_county"] = census_df["area_name"].apply(lambda x: x[-4] == ",")
census_df.head()

       area_name  STCOU        info  enrollment    year measurement  is_county
0  UNITED STATES      0  EDU010187D    40024299  1987.0     EDU0101      False
1        ALABAMA   1000  EDU010187D      733735  1987.0     EDU0101      False
2    Autauga, AL   1001  EDU010187D        6829  1987.0     EDU0101       True
3    Baldwin, AL   1003  EDU010187D       16417  1987.0     EDU0101       True
4    Barbour, AL   1005  EDU010187D        5071  1987.0     EDU0101       True

Now that there is a new column on `census_df` to index whether or not an area represents a county or not, the two different dataframes are created. The county data frame is generated using `.loc()` and the state dataframe is generated by running `np.logical_not()` method from numpy

In [16]:
county_df = census_df.loc[census_df["is_county"]]
state_df = census_df.loc[np.logical_not(census_df["is_county"])]
state_df.head()

,area_name,STCOU,info,enrollment,year,measurement,is_county
0,UNITED STATES,0,EDU010187D,40024299,1987.0,EDU0101,False
1,ALABAMA,1000,EDU010187D,733735,1987.0,EDU0101,False
69,ALASKA,2000,EDU010187D,102872,1987.0,EDU0101,False
99,ARIZONA,4000,EDU010187D,609411,1987.0,EDU0101,False
115,ARKANSAS,5000,EDU010187D,429260,1987.0,EDU0101,False

The State information was then pulled from the `area_name` column to be held in its own unique column called "State"

In [12]:
county_df["State"] = county_df["area_name"].apply(lambda x: x[-2:])
county_df.head()

/var/folders/cq/wkd76m4s1mb9xtzp3mp6kf140000gn/T/ipykernel_31994/2759333041.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  county_df["State"] = county_df["area_name"].apply(lambda x: x[-2:])

,area_name,STCOU,info,enrollment,year,measurement,is_county,State
2,"Autauga, AL",1001,EDU010187D,6829,1987.0,EDU0101,True,AL
3,"Baldwin, AL",1003,EDU010187D,16417,1987.0,EDU0101,True,AL
4,"Barbour, AL",1005,EDU010187D,5071,1987.0,EDU0101,True,AL
5,"Bibb, AL",1007,EDU010187D,3557,1987.0,EDU0101,True,AL
6,"Blount, AL",1009,EDU010187D,7319,1987.0,EDU0101,True,AL

6. For the non-county level data frame, create a new variable called division corresponding to the
state’s classification of division here (the Census Bureau-designated regions and divisions). If the row
corresponds to a non-state (i.e. UNITED STATES), return ERROR for the division. The code for this part
will not be a ton of fun to write! Write a function with basic if/elif for a single value of Area_name.
Then, use np.vectorize() to make it work for a full vector of values.

First, a dictionary containing division name as the key, and states in the division as the values paired to the key.

In [13]:
divisions={"Division 1": 
           ["CONNECTICUT", 
            'MAINE',
            'MASSACHUSETTS',
            'NEW HAMPSHIRE',
            'RHODE ISLAND',
            'VERMONT'],
           "Division 2": 
           ["NEW JERSEY",
            'NEW YORK',
            'PENNSYLVANIA'],
           'Division 3': 
           ['ILLINOIS',
            'INDIANA',
            'MICHIGAN',
            'OHIO',
            'WISCONSON'],
           'Division 4': 
           ['IOWA',
            'KANSAS',
            'MINNESOTA',
            'MISSOURI',
            'NEBRASKA',
            'NORTH DAKOTA',
            'SOUTH DAKOTA'],
           'Division 5': 
           ['DELAWARE',
            'FLORDIA',
            'GEORGIA',
            'MARYLAND',
            'NORTH CAROLINA',
            'SOUTH CAROLINA',
            'VIRGINIA',
            'WASHINGTON DC',
            'WEST VIRGINIA'],
           'Division 6': 
           ['ALABAMA',
            'KENTUCKY',
            'MISSISSIPPI',
            'TENNESSEE'],
           'Division 7':
           ['ARKANSAS',
            'LOUISIANA',
            'OKLAHOMA',
            'TEXAS'],
           'Division 8':
            ['ARIZONA',
            'COLORADO',
            'IDAHO',
            'NEVADA',
            'MONTANA',
            'NEW MEXICO',
            'UTAH',
            'WYOMING'],
           'Division 9': 
           ['ALASKA',
            'CALIFORNIA',
            'HAWAII',
            'OREGON',
            'WASHINGTON']}

In [27]:
def return_key(val):
    for key, value in divisions.items():
        x = divisions
        if val in value:
            return key
        else:
            return("ERROR")

In [29]:
def return_div(val):
    div1 = ["CONNECTICUT", 'MAINE','MASSACHUSETTS','NEW HAMPSHIRE','RHODE ISLAND','VERMONT']
    div2 = ["NEW JERSEY",'NEW YORK','PENNSYLVANIA']
    div3 = ['ILLINOIS','INDIANA','MICHIGAN','OHIO','WISCONSON']
    div4 = ['IOWA','KANSAS','MINNESOTA','MISSOURI','NEBRASKA','NORTH DAKOTA','SOUTH DAKOTA']
    div5 = ['DELAWARE','FLORDIA','GEORGIA','MARYLAND','NORTH CAROLINA','SOUTH CAROLINA','VIRGINIA','WASHINGTON DC','WEST VIRGINIA']
    div6 = ['ALABAMA','KENTUCKY','MISSISSIPPI','TENNESSEE']
    div7 = ['ARKANSAS','LOUISIANA','OKLAHOMA','TEXAS']
    div8 = ['ARIZONA','COLORADO','IDAHO','NEVADA','MONTANA','NEW MEXICO','UTAH','WYOMING']
    div9 = ['ALASKA','CALIFORNIA','HAWAII','OREGON','WASHINGTON']
    
    if val in div1:
        return("Division 1")
    elif val in div2:
        return("Division 2")
    elif val in div3:
        return("Division 3")
    elif val in div4:
        return("Division 4")
    elif val in div5:
        return("Division 5")
    elif val in div6:
        return("Division 6")
    elif val in div7:
        return("Division 7")
    elif val in div8:
        return("Division 8")
    elif val in div9:
        return("Division 9")
    else:
        return("ERROR")

In [22]:
divisions.items()

dict_items([('Division 1', ['CONNECTICUT', 'MAINE', 'MASSACHUSETTS', 'NEW HAMPSHIRE', 'RHODE ISLAND', 'VERMONT']), ('Division 2', ['NEW JERSEY', 'NEW YORK', 'PENNSYLVANIA']), ('Division 3', ['ILLINOIS', 'INDIANA', 'MICHIGAN', 'OHIO', 'WISCONSON']), ('Division 4', ['IOWA', 'KANSAS', 'MINNESOTA', 'MISSOURI', 'NEBRASKA', 'NORTH DAKOTA', 'SOUTH DAKOTA']), ('Division 5', ['DELAWARE', 'FLORDIA', 'GEORGIA', 'MARYLAND', 'NORTH CAROLINA', 'SOUTH CAROLINA', 'VIRGINIA', 'WASHINGTON DC', 'WEST VIRGINIA']), ('Division 6', ['ALABAMA', 'KENTUCKY', 'MISSISSIPPI', 'TENNESSEE']), ('Division 7', ['ARKANSAS', 'LOUISIANA', 'OKLAHOMA', 'TEXAS']), ('Division 8', ['ARIZONA', 'COLORADO', 'IDAHO', 'NEVADA', 'MONTANA', 'NEW MEXICO', 'UTAH', 'WYOMING']), ('Division 9', ['ALASKA', 'CALIFORNIA', 'HAWAII', 'OREGON', 'WASHINGTON'])])

In [31]:
state_df["division"] = np.vectorize(return_div)(state_df["area_name"])
state_df.head()

/var/folders/cq/wkd76m4s1mb9xtzp3mp6kf140000gn/T/ipykernel_31994/2538730563.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  state_df["division"] = np.vectorize(return_div)(state_df["area_name"])

,area_name,STCOU,info,enrollment,year,measurement,is_county,division
0,UNITED STATES,0,EDU010187D,40024299,1987.0,EDU0101,False,ERROR
1,ALABAMA,1000,EDU010187D,733735,1987.0,EDU0101,False,Division 6
69,ALASKA,2000,EDU010187D,102872,1987.0,EDU0101,False,Division 9
99,ARIZONA,4000,EDU010187D,609411,1987.0,EDU0101,False,Division 8
115,ARKANSAS,5000,EDU010187D,429260,1987.0,EDU0101,False,Division 7